{
  "collection_path": "C:\\Users\\Cope\\Documents\\GitHub\\agent-skills",
  "total_agents": 0,
  "total_skills": 70,
  "available_agents": [],
  "available_skills": [
    {
      "name": "claude-code-hooks",
      "description": "Interactive skill for setting up Claude Code hooks in any workspace. Use when users want to configure hooks for Claude Code, create automation around tool execution, add notifications, format code automatically, protect files, validate commands, log operations, or customize Claude Code behavior. Triggers include \"set up hooks\", \"create hook\", \"configure Claude Code\", \"add PreToolUse hook\", \"PostToolUse automation\", \"notification hook\", \"protect files from editing\", or any request to automate Claude Code's behavior through hooks.",
      "path": "claude-code-hooks-skill.skill",
      "triggers": [
        "desktop",
        "git",
        "go",
        "prettier",
        "python"
      ],
      "category": "database"
    },
    {
      "name": "gemini-cli",
      "description": "Programmatic interaction with Google's Gemini models via gemini-cli headless mode. Use this skill when Claude needs to collaborate with Gemini LLMs for tasks like advanced debugging, code analysis, research synthesis, or when building scripts that leverage Gemini's capabilities. Also use when helping users create automation scripts that use gemini-cli. Triggers include requests to \"ask Gemini\", \"use Gemini to\", \"collaborate with Gemini\", \"get Gemini's perspective\", or any scripting task involving gemini-cli.",
      "path": "gemini-cli.skill",
      "triggers": [
        "auth",
        "cli",
        "go"
      ],
      "category": "ui"
    },
    {
      "name": "gemini-collaborate",
      "description": "Agentic collaboration with Google Gemini via CLI for tasks leveraging Gemini's ~1M token context window (~5x Claude's). Use when needing to review large codebases, analyze many files simultaneously, get a second AI opinion, search Google for current information, brainstorm ideas, or validate approaches. Triggers include code review of large projects, analyzing entire repositories, bulk file processing, getting alternative perspectives, searching for recent information via Google, or any task benefiting from Gemini's massive context capacity.",
      "path": "gemini-collaborate.skill",
      "triggers": [
        "api",
        "auth",
        "cli",
        "docker",
        "git",
        "go",
        "python",
        "react",
        "security",
        "validation"
      ],
      "category": "database"
    },
    {
      "name": "gemini-genkit",
      "description": "Comprehensive guide for building applications with Google's Gemini API and Firebase Genkit framework in TypeScript. Use when developing AI workflows with Gemini models, implementing function calling, structured outputs, RAG systems, multimodal processing (text, image, video, audio), or integrating Google AI tools (Search, Maps, Code Execution, Deep Research). Covers both direct Gemini SDK (@google/genai) and Genkit framework (@genkit-ai/google-genai) patterns.",
      "path": "gemini-genkit.skill",
      "triggers": [
        "api",
        "async",
        "auth",
        "await",
        "cli",
        "go",
        "ink",
        "mcp",
        "next",
        "python",
        "typescript",
        "validation",
        "zod"
      ],
      "category": "ui"
    },
    {
      "name": "gsap",
      "description": "Professional-grade JavaScript animation development with GSAP (GreenSock Animation Platform). Use this skill when creating animations with GSAP, including tweens, timelines, scroll-triggered animations, SVG animations, morphing, draggable interactions, split text effects, and any other GSAP-powered animations. Triggers include questions about GSAP syntax, methods like gsap.to(), gsap.from(), gsap.timeline(), ScrollTrigger, Flip, Draggable, SplitText, or any GSAP plugin. Also use for building production-ready animations, optimizing performance, creating complex animation sequences, or troubleshooting GSAP code.",
      "path": "gsap.skill",
      "triggers": [
        "angular",
        "api",
        "desktop",
        "go",
        "ink",
        "java",
        "javascript",
        "react",
        "vue"
      ],
      "category": "ui"
    },
    {
      "name": "motion",
      "description": "Comprehensive Motion animation library guide for React, JavaScript (vanilla), and Vue. Use when building web animations, including simple transforms, scroll-triggered effects, gesture-driven interactions, layout animations, SVG path animations, or any production-grade UI animations. Covers the complete Motion API including motion components, hooks, transitions, springs, and all animation patterns. Triggers include building animations, animating elements, implementing scroll effects, creating interactive gestures, or working with the Motion/Framer Motion library.",
      "path": "motion.skill",
      "triggers": [
        "api",
        "git",
        "github",
        "hardware",
        "ink",
        "java",
        "javascript",
        "next",
        "nuxt",
        "radix",
        "react",
        "tailwind",
        "vue"
      ],
      "category": "ui"
    },
    {
      "name": "astro-build",
      "description": "Comprehensive documentation for Astro, the web framework for content-driven websites. Covers Getting Started, Concepts, Guides, Recipes, and API References. Use this skill when you need to answer questions about Astro, build Astro projects, or troubleshoot Astro code.",
      "path": "astro-build.skill",
      "triggers": [
        "api",
        "cli",
        "go"
      ],
      "category": "ui"
    },
    {
      "name": "express",
      "description": "Express.js 5.x web framework for Node.js - complete API reference, middleware patterns, routing, error handling, and production best practices. Use when building Express applications, creating REST APIs, implementing middleware, handling routes, managing errors, configuring security, optimizing performance, or migrating from Express 4 to 5. Triggers on Express, express.js, Node.js web server, REST API, middleware, routing, req/res objects, app.use, app.get, app.post, router, error handling, body-parser, static files, template engines.",
      "path": "express.skill",
      "triggers": [
        "api",
        "async",
        "auth",
        "await",
        "cli",
        "express",
        "java",
        "javascript",
        "next",
        "rust",
        "security",
        "validation"
      ],
      "category": "ui"
    },
    {
      "name": "best-practices",
      "description": "Universal software engineering best practices for any language or project. Use when programming, refactoring code, designing systems, reviewing code, or ensuring production-ready quality. Covers fundamental principles (SOLID, DRY, KISS, YAGNI), architectural patterns (SoC, SSOT, LoD, CQS, DbC), and operational reliability (ETC, PoLP, CoC, Idempotency). Apply when building new features, cleaning up codebases, improving maintainability, or ensuring code follows industry standards.",
      "path": "best-practices.skill",
      "triggers": [
        "api",
        "auth",
        "go",
        "validation"
      ],
      "category": "ui"
    },
    {
      "name": "code-cleanup-final-pass",
      "description": "Deep code review and cleanup workflow for performing a final quality pass before committing code or opening pull requests. Use when the user wants to review and clean up a codebase to ensure production-ready quality, eliminate technical debt, remove debug code, simplify overcomplicated logic, or prepare code for public repository contribution. Triggers include \"final pass\", \"cleanup before commit\", \"review before PR\", \"clean up this code\", \"prepare for production\", or any request to audit and improve code quality across a project.",
      "path": "code-cleanup-final-pass.skill",
      "triggers": [
        "api",
        "eslint",
        "express",
        "git",
        "go",
        "java",
        "javascript",
        "prettier",
        "python",
        "rust",
        "security",
        "typescript"
      ],
      "category": "database"
    },
    {
      "name": "modern-frontend-design",
      "description": "Create distinctive, production-grade frontend interfaces with high design quality and modern aesthetics. Use when building web components, React/HTML artifacts, landing pages, dashboards, UI libraries, or any frontend interface. Generates creative, polished code with bold aesthetic choices. Specializes in dark themes, glassmorphism, minimalist design, and explicitly avoids generic AI patterns like purple gradients and cookie-cutter layouts.",
      "path": "modern-frontend-design.skill",
      "triggers": [
        "go",
        "ink",
        "material",
        "react",
        "rust",
        "vue"
      ],
      "category": "ui"
    },
    {
      "name": "expo-android-widgets",
      "description": "Build Android home screen widgets for React Native Expo apps using react-native-android-widget. Use this skill when creating launcher widgets, implementing widget task handlers, designing widget UI with primitives (FlexWidget, TextWidget, ImageWidget, ListWidget), configuring Expo config plugins for widgets, handling widget clicks and updates, or any Android widget development in Expo/React Native projects. Triggers include widget, home screen widget, launcher widget, Android widget, react-native-android-widget.",
      "path": "expo-android-widgets.skill",
      "triggers": [
        "async",
        "cli",
        "go",
        "ink",
        "material",
        "react"
      ],
      "category": "ui"
    },
    {
      "name": "go-best-practices",
      "description": "Comprehensive Go development best practices based on Google's Go Style Guide. Use when developing, reviewing, or refactoring Go code to ensure production-ready quality. Covers naming conventions, code organization, error handling, testing strategies, documentation practices, and idiomatic Go patterns. Essential for any Go development task including new projects, code reviews, refactoring existing code, writing tests, designing APIs, structuring packages, or learning Go best practices.",
      "path": "go-best-practices.skill",
      "triggers": [
        "api",
        "auth",
        "cli",
        "go"
      ],
      "category": "ui"
    },
    {
      "name": "home-assistant-dev",
      "description": "Comprehensive Home Assistant custom integration development skill. Use when developing Home Assistant integrations, custom components, or plugins. Covers entity platforms, config flows, data management, quality requirements, testing, and HACS publishing. Includes complete reference documentation for all 47+ entity types, integration quality scale requirements, and step-by-step publishing guides.",
      "path": "home-assistant-dev.skill",
      "triggers": [
        "api",
        "async",
        "auth",
        "await",
        "cli",
        "discord",
        "git",
        "github",
        "go",
        "hardware",
        "ink",
        "python",
        "security",
        "validation",
        "websocket"
      ],
      "category": "ui"
    },
    {
      "name": "mcp-setup",
      "description": "Set up MCP (Model Context Protocol) servers in Claude Code workspaces for testing. Use this skill when a user provides a local file path to an MCP server, a GitHub repository URL containing an MCP server, or asks to configure/install/set up an MCP server for testing. Handles creating .mcp.json configuration, cloning repositories, and guiding users through the setup process.",
      "path": "mcp-setup.skill",
      "triggers": [
        "api",
        "git",
        "github",
        "mcp",
        "python",
        "typescript"
      ],
      "category": "ui"
    },
    {
      "name": "mcp-test-harness",
      "description": "Build fully automated integration test suites for MCP (Model Context Protocol) servers using STDIO transport. Use when creating pytest tests for Python/FastMCP servers, Vitest tests for TypeScript servers, or using MCP Inspector CLI for universal testing. Triggers include \"test my MCP server\", \"create MCP tests\", \"automated MCP testing\", \"integration tests for MCP\", or any request to verify MCP server functionality with real data validation.",
      "path": "mcp-test-harness.skill",
      "triggers": [
        "api",
        "async",
        "cli",
        "git",
        "go",
        "mcp",
        "pytest",
        "python",
        "typescript",
        "validation",
        "vite",
        "vitest"
      ],
      "category": "ui"
    },
    {
      "name": "fastmcp-v3-migration",
      "description": "Production-ready migration from FastMCP v2.x to v3.0. Use when upgrading MCP servers built on FastMCP to v3, migrating legacy FastMCP code, converting v2 patterns to v3 architecture (providers/transforms), or when user mentions FastMCP upgrade, migration, or v3. Covers breaking changes, deprecated patterns, new v3 features (providers, transforms, versioning, authorization), and testing strategies. Ensures zero-regression migrations with user confirmation checkpoints.",
      "path": "fastmcp-v3-migration.skill",
      "triggers": [
        "api",
        "async",
        "auth",
        "await",
        "cli",
        "express",
        "fastapi",
        "flask",
        "git",
        "github",
        "mcp",
        "next",
        "pytest",
        "python",
        "serial",
        "validation"
      ],
      "category": "ui"
    },
    {
      "name": "node-to-bun-migration",
      "description": "Migrate Node.js projects to Bun with zero regression and no breaking changes. Use when the user wants to migrate to Bun, optimize performance by switching to Bun, evaluate Bun compatibility, or identify migration blockers. Provides incremental adoption strategies, compatibility assessment, and comprehensive testing guidance.",
      "path": "node-to-bun-migration.skill",
      "triggers": [
        "api",
        "async",
        "await",
        "discord",
        "docker",
        "esbuild",
        "eslint",
        "express",
        "git",
        "github",
        "go",
        "java",
        "javascript",
        "jest",
        "next",
        "rollup",
        "typescript",
        "validation",
        "webpack"
      ],
      "category": "ui"
    },
    {
      "name": "node-to-deno-migration",
      "description": "Migrate Node.js projects to Deno 2.0+ without breaking changes or regressions. Use when migrating existing Node.js projects, modernizing JavaScript/TypeScript codebases, or adopting Deno's built-in toolchain while maintaining compatibility with existing npm packages and Node.js APIs.",
      "path": "node-to-deno-migration.skill",
      "triggers": [
        "api",
        "await",
        "cli",
        "eslint",
        "express",
        "git",
        "github",
        "go",
        "java",
        "javascript",
        "jest",
        "next",
        "prettier",
        "security",
        "typescript",
        "validation",
        "vite",
        "vitest"
      ],
      "category": "ui"
    },
    {
      "name": "mypy",
      "description": "Professional static type checking for Python with mypy (v1.19.1). Use when working with Python type hints, type annotations, or integrating mypy into codebases for: (1) Adding type annotations to Python code, (2) Configuring mypy (mypy.ini, pyproject.toml, setup.cfg), (3) Resolving mypy errors and type checking issues, (4) Using advanced type patterns (Generics, Protocols, TypedDict), (5) Running mypy in CI/CD or development workflows, (6) Creating or working with stub files, (7) Migrating existing codebases to typed Python, or (8) Any mypy-related development task.",
      "path": "mypy.skill",
      "triggers": [
        "api",
        "cli",
        "git",
        "github",
        "python"
      ],
      "category": "general"
    },
    {
      "name": "nativewind",
      "description": "NativeWind v4 for React Native - use Tailwind CSS to style React Native components. Use when building React Native apps with Tailwind-style className syntax, configuring NativeWind with Metro/Expo/Next.js, styling third-party components with cssInterop/remapProps, implementing dark mode or themes, or handling React Native-specific styling quirks like flex defaults and platform differences.",
      "path": "nativewind.skill",
      "triggers": [
        "api",
        "async",
        "go",
        "next",
        "react",
        "tailwind",
        "typescript"
      ],
      "category": "ui"
    },
    {
      "name": "shadcn",
      "description": "Comprehensive guide for working with shadcn/ui components, theming, CLI, and registries. Use when building UIs with shadcn/ui, installing components, customizing themes, working with component registries, integrating with React Hook Form or TanStack Form, or needing documentation about any shadcn/ui component (Accordion, Alert, Avatar, Badge, Button, Card, Chart, Dialog, Form, Input, Select, Table, Sidebar, etc.). Also use when exploring third-party shadcn registries or setting up custom registries.",
      "path": "shadcn.skill",
      "triggers": [
        "api",
        "auth",
        "cli",
        "git",
        "github",
        "go",
        "ink",
        "java",
        "javascript",
        "mcp",
        "next",
        "python",
        "radix",
        "react",
        "shadcn",
        "tailwind",
        "typescript",
        "vite"
      ],
      "category": "ui"
    },
    {
      "name": "rust-dev",
      "description": "Comprehensive Rust development guidance following official API guidelines and industry best practices, including mandatory agent-specific requirements for optimization, tooling, and code quality. Use when writing, reviewing, or refactoring Rust code, designing APIs, implementing error handling, writing documentation, optimizing performance, working with specific tools (axum, polars, tokio, maturin), or any Rust development task requiring production-quality standards. Covers naming conventions, type safety, trait implementations, error handling, testing, async patterns, memory management, preferred tooling, and pre-commit validation.",
      "path": "rust-dev.skill",
      "triggers": [
        "api",
        "async",
        "cli",
        "go",
        "ink",
        "material",
        "python",
        "rust",
        "security",
        "validation"
      ],
      "category": "ui"
    },
    {
      "name": "svelte5",
      "description": "Comprehensive Svelte 5 development skill covering reactive programming with runes ($state, $derived, $effect, $props), component architecture, template syntax, styling, animations, TypeScript integration, and SvelteKit full-stack framework. Use when building Svelte applications, components, or working with .svelte files. Includes complete API references, migration guides, testing strategies, and error troubleshooting.",
      "path": "svelte5.skill",
      "triggers": [
        "api",
        "async",
        "await",
        "cli",
        "discord",
        "git",
        "github",
        "go",
        "react",
        "svelte",
        "typescript",
        "validation",
        "vite"
      ],
      "category": "ui"
    },
    {
      "name": "tauri",
      "description": "Comprehensive Tauri v2 development framework documentation. Use when building cross-platform desktop and mobile applications with Tauri, configuring Tauri projects, implementing Rust commands callable from frontend JavaScript/TypeScript, setting up IPC (inter-process communication), configuring security permissions and capabilities, integrating official Tauri plugins (file-system, dialog, notifications, http-client, shell, updater, etc.), debugging Tauri apps, distributing/signing/publishing apps for Windows/macOS/Linux/iOS/Android, or migrating from Tauri v1. Covers the complete Tauri ecosystem including CLI, configuration, frontend framework integrations, and production deployment.",
      "path": "tauri-skill.skill",
      "triggers": [
        "api",
        "async",
        "auth",
        "await",
        "biome",
        "cli",
        "desktop",
        "electron",
        "git",
        "github",
        "go",
        "ink",
        "java",
        "javascript",
        "next",
        "nuxt",
        "react",
        "rust",
        "security",
        "serial",
        "svelte",
        "tauri",
        "typescript",
        "vite",
        "vue",
        "websocket"
      ],
      "category": "ui"
    },
    {
      "name": "playwright-cli",
      "description": "Browser automation and testing with Playwright CLI. Use when Claude needs to automate browser interactions, run end-to-end tests, capture screenshots, generate test code, set up Playwright in a project, or control browsers programmatically. Triggers include requests for browser automation, web testing, screenshot capture, test generation, UI testing, form filling, web scraping with browser rendering, or Playwright installation/setup.",
      "path": "playwright-cli.skill",
      "triggers": [
        "api",
        "async",
        "auth",
        "await",
        "cli",
        "git",
        "github",
        "go",
        "ink",
        "java",
        "javascript",
        "playwright",
        "python",
        "typescript"
      ],
      "category": "ui"
    },
    {
      "name": "biome",
      "description": "Comprehensive Biome (biomejs.dev) integration for professional TypeScript/JavaScript development. Use for linting, formatting, code quality, and flawless Biome integration into codebases. Covers installation, configuration, migration from ESLint/Prettier, all linter rules, formatter options, CLI usage, editor integration, monorepo setup, and CI/CD integration. Use when working with Biome tooling, configuring biome.json, setting up linting/formatting, migrating projects, debugging Biome issues, or implementing production-ready Biome workflows.",
      "path": "biome.skill",
      "triggers": [
        "biome",
        "cli",
        "eslint",
        "git",
        "github",
        "go",
        "graphql",
        "java",
        "javascript",
        "next",
        "prettier",
        "python",
        "react",
        "typescript"
      ],
      "category": "database"
    },
    {
      "name": "get-time",
      "description": "Get the current local time in various formats. Use when the user asks for the current time, what time it is, the date, or needs timestamp information. Works across claude.ai web, Claude Desktop, and Claude Code environments.",
      "path": "get-time.skill",
      "triggers": [
        "desktop",
        "go",
        "python"
      ],
      "category": "ui"
    },
    {
      "name": "github-wikis",
      "description": "Comprehensive guide for working with GitHub repository wikis. Use when users need to work with GitHub wikis for documentation, including creating and editing wiki pages, managing permissions, working with wikis locally via Git, creating navigation elements (sidebars/footers), viewing history, or understanding wiki capabilities and limitations.",
      "path": "github-wikis.skill",
      "triggers": [
        "cli",
        "git",
        "github",
        "go",
        "ink"
      ],
      "category": "ui"
    },
    {
      "name": "local-skill-creator",
      "description": "Local skill creation toolkit for Claude Code. Use when users want to create, edit, or package skills locally on their PC using Claude Code. This skill provides all tools, templates, and guidance for building complete skills that can be distributed as .skill files. Works entirely in the current working directory.",
      "path": "local-skill-creator.skill",
      "triggers": [
        "api",
        "cli",
        "go",
        "ink",
        "material",
        "next",
        "python",
        "react",
        "validation"
      ],
      "category": "ui"
    },
    {
      "name": "pdf-to-markdown",
      "description": "Convert PDF documents to LLM-friendly Markdown format using pymupdf4llm. Use when working with PDF files that need to be converted to markdown, extracted as text for analysis, or made accessible for LLM processing. Handles complex layouts, tables, multi-column documents, and preserves formatting structure.",
      "path": "pdf-to-markdown.skill",
      "triggers": [
        "python"
      ],
      "category": "database"
    },
    {
      "name": "plugin-builder",
      "description": "Build Claude Code plugins from scratch or by composing existing skills. Use when creating new plugins, converting skills to plugins, adding commands/agents/hooks/MCP servers to plugins, packaging plugins for distribution, or publishing plugins to marketplaces. Triggers include requests to create a plugin, make a Claude Code extension, add commands or agents, set up hooks, configure MCP servers, test plugins locally, create a marketplace, publish plugins, or distribute plugins to teams.",
      "path": "plugin-builder.skill",
      "triggers": [
        "auth",
        "git",
        "github",
        "go",
        "mcp",
        "python",
        "rust",
        "security",
        "validation"
      ],
      "category": "ui"
    },
    {
      "name": "uiverse",
      "description": "Extract HTML and CSS code from UIVerse.io UI components. Use this when the user wants to get the code for a specific UIVerse component URL. It bypasses Cloudflare and returns clean HTML/CSS.",
      "path": "uiverse.skill",
      "triggers": [
        "auth",
        "python"
      ],
      "category": "ui"
    },
    {
      "name": "v0-version-planner",
      "description": "Systematic version planning before starting v0 (initial prototype) development. Use when the user wants to validate and update dependency versions in project blueprints, technical plans, or before starting development on a new project. Checks that all specified library/framework versions are current stable releases to prevent technical debt. Triggers on phrases like \"check versions\", \"update blueprint dependencies\", \"plan v0 development\", \"validate tech stack versions\", or when starting a new project with a technical blueprint.",
      "path": "v0-version-planner.skill",
      "triggers": [
        "biome",
        "eslint",
        "go",
        "java",
        "mcp",
        "next",
        "python",
        "react",
        "rust",
        "typescript",
        "validation",
        "zod"
      ],
      "category": "testing"
    },
    {
      "name": "web-scraper",
      "description": "Web scraping with Cloudflare bypass capability. Use when Claude needs to fetch content from websites that may have bot protection, especially sites protected by Cloudflare. Automatically converts HTML to clean markdown format for easy processing. Use for retrieving documentation, articles, or any web content that needs to be analyzed or processed.",
      "path": "web-scraper.skill",
      "triggers": [
        "api",
        "python",
        "security"
      ],
      "category": "api"
    },
    {
      "name": "claude-code-hooks",
      "description": "Interactive skill for setting up Claude Code hooks in any workspace. Use when users want to configure hooks for Claude Code, create automation around tool execution, add notifications, format code automatically, protect files, validate commands, log operations, or customize Claude Code behavior. Triggers include \"set up hooks\", \"create hook\", \"configure Claude Code\", \"add PreToolUse hook\", \"PostToolUse automation\", \"notification hook\", \"protect files from editing\", or any request to automate Claude Code's behavior through hooks.",
      "path": "claude-code-hooks-skill.skill",
      "triggers": [
        "desktop",
        "git",
        "go",
        "prettier",
        "python"
      ],
      "category": "database"
    },
    {
      "name": "gemini-cli",
      "description": "Programmatic interaction with Google's Gemini models via gemini-cli headless mode. Use this skill when Claude needs to collaborate with Gemini LLMs for tasks like advanced debugging, code analysis, research synthesis, or when building scripts that leverage Gemini's capabilities. Also use when helping users create automation scripts that use gemini-cli. Triggers include requests to \"ask Gemini\", \"use Gemini to\", \"collaborate with Gemini\", \"get Gemini's perspective\", or any scripting task involving gemini-cli.",
      "path": "gemini-cli.skill",
      "triggers": [
        "auth",
        "cli",
        "go"
      ],
      "category": "ui"
    },
    {
      "name": "gemini-collaborate",
      "description": "Agentic collaboration with Google Gemini via CLI for tasks leveraging Gemini's ~1M token context window (~5x Claude's). Use when needing to review large codebases, analyze many files simultaneously, get a second AI opinion, search Google for current information, brainstorm ideas, or validate approaches. Triggers include code review of large projects, analyzing entire repositories, bulk file processing, getting alternative perspectives, searching for recent information via Google, or any task benefiting from Gemini's massive context capacity.",
      "path": "gemini-collaborate.skill",
      "triggers": [
        "api",
        "auth",
        "cli",
        "docker",
        "git",
        "go",
        "python",
        "react",
        "security",
        "validation"
      ],
      "category": "database"
    },
    {
      "name": "gemini-genkit",
      "description": "Comprehensive guide for building applications with Google's Gemini API and Firebase Genkit framework in TypeScript. Use when developing AI workflows with Gemini models, implementing function calling, structured outputs, RAG systems, multimodal processing (text, image, video, audio), or integrating Google AI tools (Search, Maps, Code Execution, Deep Research). Covers both direct Gemini SDK (@google/genai) and Genkit framework (@genkit-ai/google-genai) patterns.",
      "path": "gemini-genkit.skill",
      "triggers": [
        "api",
        "async",
        "auth",
        "await",
        "cli",
        "go",
        "ink",
        "mcp",
        "next",
        "python",
        "typescript",
        "validation",
        "zod"
      ],
      "category": "ui"
    },
    {
      "name": "gsap",
      "description": "Professional-grade JavaScript animation development with GSAP (GreenSock Animation Platform). Use this skill when creating animations with GSAP, including tweens, timelines, scroll-triggered animations, SVG animations, morphing, draggable interactions, split text effects, and any other GSAP-powered animations. Triggers include questions about GSAP syntax, methods like gsap.to(), gsap.from(), gsap.timeline(), ScrollTrigger, Flip, Draggable, SplitText, or any GSAP plugin. Also use for building production-ready animations, optimizing performance, creating complex animation sequences, or troubleshooting GSAP code.",
      "path": "gsap.skill",
      "triggers": [
        "angular",
        "api",
        "desktop",
        "go",
        "ink",
        "java",
        "javascript",
        "react",
        "vue"
      ],
      "category": "ui"
    },
    {
      "name": "motion",
      "description": "Comprehensive Motion animation library guide for React, JavaScript (vanilla), and Vue. Use when building web animations, including simple transforms, scroll-triggered effects, gesture-driven interactions, layout animations, SVG path animations, or any production-grade UI animations. Covers the complete Motion API including motion components, hooks, transitions, springs, and all animation patterns. Triggers include building animations, animating elements, implementing scroll effects, creating interactive gestures, or working with the Motion/Framer Motion library.",
      "path": "motion.skill",
      "triggers": [
        "api",
        "git",
        "github",
        "hardware",
        "ink",
        "java",
        "javascript",
        "next",
        "nuxt",
        "radix",
        "react",
        "tailwind",
        "vue"
      ],
      "category": "ui"
    },
    {
      "name": "astro-build",
      "description": "Comprehensive documentation for Astro, the web framework for content-driven websites. Covers Getting Started, Concepts, Guides, Recipes, and API References. Use this skill when you need to answer questions about Astro, build Astro projects, or troubleshoot Astro code.",
      "path": "astro-build.skill",
      "triggers": [
        "api",
        "cli",
        "go"
      ],
      "category": "ui"
    },
    {
      "name": "express",
      "description": "Express.js 5.x web framework for Node.js - complete API reference, middleware patterns, routing, error handling, and production best practices. Use when building Express applications, creating REST APIs, implementing middleware, handling routes, managing errors, configuring security, optimizing performance, or migrating from Express 4 to 5. Triggers on Express, express.js, Node.js web server, REST API, middleware, routing, req/res objects, app.use, app.get, app.post, router, error handling, body-parser, static files, template engines.",
      "path": "express.skill",
      "triggers": [
        "api",
        "async",
        "auth",
        "await",
        "cli",
        "express",
        "java",
        "javascript",
        "next",
        "rust",
        "security",
        "validation"
      ],
      "category": "ui"
    },
    {
      "name": "best-practices",
      "description": "Universal software engineering best practices for any language or project. Use when programming, refactoring code, designing systems, reviewing code, or ensuring production-ready quality. Covers fundamental principles (SOLID, DRY, KISS, YAGNI), architectural patterns (SoC, SSOT, LoD, CQS, DbC), and operational reliability (ETC, PoLP, CoC, Idempotency). Apply when building new features, cleaning up codebases, improving maintainability, or ensuring code follows industry standards.",
      "path": "best-practices.skill",
      "triggers": [
        "api",
        "auth",
        "go",
        "validation"
      ],
      "category": "ui"
    },
    {
      "name": "code-cleanup-final-pass",
      "description": "Deep code review and cleanup workflow for performing a final quality pass before committing code or opening pull requests. Use when the user wants to review and clean up a codebase to ensure production-ready quality, eliminate technical debt, remove debug code, simplify overcomplicated logic, or prepare code for public repository contribution. Triggers include \"final pass\", \"cleanup before commit\", \"review before PR\", \"clean up this code\", \"prepare for production\", or any request to audit and improve code quality across a project.",
      "path": "code-cleanup-final-pass.skill",
      "triggers": [
        "api",
        "eslint",
        "express",
        "git",
        "go",
        "java",
        "javascript",
        "prettier",
        "python",
        "rust",
        "security",
        "typescript"
      ],
      "category": "database"
    },
    {
      "name": "modern-frontend-design",
      "description": "Create distinctive, production-grade frontend interfaces with high design quality and modern aesthetics. Use when building web components, React/HTML artifacts, landing pages, dashboards, UI libraries, or any frontend interface. Generates creative, polished code with bold aesthetic choices. Specializes in dark themes, glassmorphism, minimalist design, and explicitly avoids generic AI patterns like purple gradients and cookie-cutter layouts.",
      "path": "modern-frontend-design.skill",
      "triggers": [
        "go",
        "ink",
        "material",
        "react",
        "rust",
        "vue"
      ],
      "category": "ui"
    },
    {
      "name": "expo-android-widgets",
      "description": "Build Android home screen widgets for React Native Expo apps using react-native-android-widget. Use this skill when creating launcher widgets, implementing widget task handlers, designing widget UI with primitives (FlexWidget, TextWidget, ImageWidget, ListWidget), configuring Expo config plugins for widgets, handling widget clicks and updates, or any Android widget development in Expo/React Native projects. Triggers include widget, home screen widget, launcher widget, Android widget, react-native-android-widget.",
      "path": "expo-android-widgets.skill",
      "triggers": [
        "async",
        "cli",
        "go",
        "ink",
        "material",
        "react"
      ],
      "category": "ui"
    },
    {
      "name": "go-best-practices",
      "description": "Comprehensive Go development best practices based on Google's Go Style Guide. Use when developing, reviewing, or refactoring Go code to ensure production-ready quality. Covers naming conventions, code organization, error handling, testing strategies, documentation practices, and idiomatic Go patterns. Essential for any Go development task including new projects, code reviews, refactoring existing code, writing tests, designing APIs, structuring packages, or learning Go best practices.",
      "path": "go-best-practices.skill",
      "triggers": [
        "api",
        "auth",
        "cli",
        "go"
      ],
      "category": "ui"
    },
    {
      "name": "home-assistant-dev",
      "description": "Comprehensive Home Assistant custom integration development skill. Use when developing Home Assistant integrations, custom components, or plugins. Covers entity platforms, config flows, data management, quality requirements, testing, and HACS publishing. Includes complete reference documentation for all 47+ entity types, integration quality scale requirements, and step-by-step publishing guides.",
      "path": "home-assistant-dev.skill",
      "triggers": [
        "api",
        "async",
        "auth",
        "await",
        "cli",
        "discord",
        "git",
        "github",
        "go",
        "hardware",
        "ink",
        "python",
        "security",
        "validation",
        "websocket"
      ],
      "category": "ui"
    },
    {
      "name": "mcp-setup",
      "description": "Set up MCP (Model Context Protocol) servers in Claude Code workspaces for testing. Use this skill when a user provides a local file path to an MCP server, a GitHub repository URL containing an MCP server, or asks to configure/install/set up an MCP server for testing. Handles creating .mcp.json configuration, cloning repositories, and guiding users through the setup process.",
      "path": "mcp-setup.skill",
      "triggers": [
        "api",
        "git",
        "github",
        "mcp",
        "python",
        "typescript"
      ],
      "category": "ui"
    },
    {
      "name": "mcp-test-harness",
      "description": "Build fully automated integration test suites for MCP (Model Context Protocol) servers using STDIO transport. Use when creating pytest tests for Python/FastMCP servers, Vitest tests for TypeScript servers, or using MCP Inspector CLI for universal testing. Triggers include \"test my MCP server\", \"create MCP tests\", \"automated MCP testing\", \"integration tests for MCP\", or any request to verify MCP server functionality with real data validation.",
      "path": "mcp-test-harness.skill",
      "triggers": [
        "api",
        "async",
        "cli",
        "git",
        "go",
        "mcp",
        "pytest",
        "python",
        "typescript",
        "validation",
        "vite",
        "vitest"
      ],
      "category": "ui"
    },
    {
      "name": "fastmcp-v3-migration",
      "description": "Production-ready migration from FastMCP v2.x to v3.0. Use when upgrading MCP servers built on FastMCP to v3, migrating legacy FastMCP code, converting v2 patterns to v3 architecture (providers/transforms), or when user mentions FastMCP upgrade, migration, or v3. Covers breaking changes, deprecated patterns, new v3 features (providers, transforms, versioning, authorization), and testing strategies. Ensures zero-regression migrations with user confirmation checkpoints.",
      "path": "fastmcp-v3-migration.skill",
      "triggers": [
        "api",
        "async",
        "auth",
        "await",
        "cli",
        "express",
        "fastapi",
        "flask",
        "git",
        "github",
        "mcp",
        "next",
        "pytest",
        "python",
        "serial",
        "validation"
      ],
      "category": "ui"
    },
    {
      "name": "node-to-bun-migration",
      "description": "Migrate Node.js projects to Bun with zero regression and no breaking changes. Use when the user wants to migrate to Bun, optimize performance by switching to Bun, evaluate Bun compatibility, or identify migration blockers. Provides incremental adoption strategies, compatibility assessment, and comprehensive testing guidance.",
      "path": "node-to-bun-migration.skill",
      "triggers": [
        "api",
        "async",
        "await",
        "discord",
        "docker",
        "esbuild",
        "eslint",
        "express",
        "git",
        "github",
        "go",
        "java",
        "javascript",
        "jest",
        "next",
        "rollup",
        "typescript",
        "validation",
        "webpack"
      ],
      "category": "ui"
    },
    {
      "name": "node-to-deno-migration",
      "description": "Migrate Node.js projects to Deno 2.0+ without breaking changes or regressions. Use when migrating existing Node.js projects, modernizing JavaScript/TypeScript codebases, or adopting Deno's built-in toolchain while maintaining compatibility with existing npm packages and Node.js APIs.",
      "path": "node-to-deno-migration.skill",
      "triggers": [
        "api",
        "await",
        "cli",
        "eslint",
        "express",
        "git",
        "github",
        "go",
        "java",
        "javascript",
        "jest",
        "next",
        "prettier",
        "security",
        "typescript",
        "validation",
        "vite",
        "vitest"
      ],
      "category": "ui"
    },
    {
      "name": "mypy",
      "description": "Professional static type checking for Python with mypy (v1.19.1). Use when working with Python type hints, type annotations, or integrating mypy into codebases for: (1) Adding type annotations to Python code, (2) Configuring mypy (mypy.ini, pyproject.toml, setup.cfg), (3) Resolving mypy errors and type checking issues, (4) Using advanced type patterns (Generics, Protocols, TypedDict), (5) Running mypy in CI/CD or development workflows, (6) Creating or working with stub files, (7) Migrating existing codebases to typed Python, or (8) Any mypy-related development task.",
      "path": "mypy.skill",
      "triggers": [
        "api",
        "cli",
        "git",
        "github",
        "python"
      ],
      "category": "general"
    },
    {
      "name": "nativewind",
      "description": "NativeWind v4 for React Native - use Tailwind CSS to style React Native components. Use when building React Native apps with Tailwind-style className syntax, configuring NativeWind with Metro/Expo/Next.js, styling third-party components with cssInterop/remapProps, implementing dark mode or themes, or handling React Native-specific styling quirks like flex defaults and platform differences.",
      "path": "nativewind.skill",
      "triggers": [
        "api",
        "async",
        "go",
        "next",
        "react",
        "tailwind",
        "typescript"
      ],
      "category": "ui"
    },
    {
      "name": "shadcn",
      "description": "Comprehensive guide for working with shadcn/ui components, theming, CLI, and registries. Use when building UIs with shadcn/ui, installing components, customizing themes, working with component registries, integrating with React Hook Form or TanStack Form, or needing documentation about any shadcn/ui component (Accordion, Alert, Avatar, Badge, Button, Card, Chart, Dialog, Form, Input, Select, Table, Sidebar, etc.). Also use when exploring third-party shadcn registries or setting up custom registries.",
      "path": "shadcn.skill",
      "triggers": [
        "api",
        "auth",
        "cli",
        "git",
        "github",
        "go",
        "ink",
        "java",
        "javascript",
        "mcp",
        "next",
        "python",
        "radix",
        "react",
        "shadcn",
        "tailwind",
        "typescript",
        "vite"
      ],
      "category": "ui"
    },
    {
      "name": "rust-dev",
      "description": "Comprehensive Rust development guidance following official API guidelines and industry best practices, including mandatory agent-specific requirements for optimization, tooling, and code quality. Use when writing, reviewing, or refactoring Rust code, designing APIs, implementing error handling, writing documentation, optimizing performance, working with specific tools (axum, polars, tokio, maturin), or any Rust development task requiring production-quality standards. Covers naming conventions, type safety, trait implementations, error handling, testing, async patterns, memory management, preferred tooling, and pre-commit validation.",
      "path": "rust-dev.skill",
      "triggers": [
        "api",
        "async",
        "cli",
        "go",
        "ink",
        "material",
        "python",
        "rust",
        "security",
        "validation"
      ],
      "category": "ui"
    },
    {
      "name": "svelte5",
      "description": "Comprehensive Svelte 5 development skill covering reactive programming with runes ($state, $derived, $effect, $props), component architecture, template syntax, styling, animations, TypeScript integration, and SvelteKit full-stack framework. Use when building Svelte applications, components, or working with .svelte files. Includes complete API references, migration guides, testing strategies, and error troubleshooting.",
      "path": "svelte5.skill",
      "triggers": [
        "api",
        "async",
        "await",
        "cli",
        "discord",
        "git",
        "github",
        "go",
        "react",
        "svelte",
        "typescript",
        "validation",
        "vite"
      ],
      "category": "ui"
    },
    {
      "name": "tauri",
      "description": "Comprehensive Tauri v2 development framework documentation. Use when building cross-platform desktop and mobile applications with Tauri, configuring Tauri projects, implementing Rust commands callable from frontend JavaScript/TypeScript, setting up IPC (inter-process communication), configuring security permissions and capabilities, integrating official Tauri plugins (file-system, dialog, notifications, http-client, shell, updater, etc.), debugging Tauri apps, distributing/signing/publishing apps for Windows/macOS/Linux/iOS/Android, or migrating from Tauri v1. Covers the complete Tauri ecosystem including CLI, configuration, frontend framework integrations, and production deployment.",
      "path": "tauri-skill.skill",
      "triggers": [
        "api",
        "async",
        "auth",
        "await",
        "biome",
        "cli",
        "desktop",
        "electron",
        "git",
        "github",
        "go",
        "ink",
        "java",
        "javascript",
        "next",
        "nuxt",
        "react",
        "rust",
        "security",
        "serial",
        "svelte",
        "tauri",
        "typescript",
        "vite",
        "vue",
        "websocket"
      ],
      "category": "ui"
    },
    {
      "name": "playwright-cli",
      "description": "Browser automation and testing with Playwright CLI. Use when Claude needs to automate browser interactions, run end-to-end tests, capture screenshots, generate test code, set up Playwright in a project, or control browsers programmatically. Triggers include requests for browser automation, web testing, screenshot capture, test generation, UI testing, form filling, web scraping with browser rendering, or Playwright installation/setup.",
      "path": "playwright-cli.skill",
      "triggers": [
        "api",
        "async",
        "auth",
        "await",
        "cli",
        "git",
        "github",
        "go",
        "ink",
        "java",
        "javascript",
        "playwright",
        "python",
        "typescript"
      ],
      "category": "ui"
    },
    {
      "name": "biome",
      "description": "Comprehensive Biome (biomejs.dev) integration for professional TypeScript/JavaScript development. Use for linting, formatting, code quality, and flawless Biome integration into codebases. Covers installation, configuration, migration from ESLint/Prettier, all linter rules, formatter options, CLI usage, editor integration, monorepo setup, and CI/CD integration. Use when working with Biome tooling, configuring biome.json, setting up linting/formatting, migrating projects, debugging Biome issues, or implementing production-ready Biome workflows.",
      "path": "biome.skill",
      "triggers": [
        "biome",
        "cli",
        "eslint",
        "git",
        "github",
        "go",
        "graphql",
        "java",
        "javascript",
        "next",
        "prettier",
        "python",
        "react",
        "typescript"
      ],
      "category": "database"
    },
    {
      "name": "get-time",
      "description": "Get the current local time in various formats. Use when the user asks for the current time, what time it is, the date, or needs timestamp information. Works across claude.ai web, Claude Desktop, and Claude Code environments.",
      "path": "get-time.skill",
      "triggers": [
        "desktop",
        "go",
        "python"
      ],
      "category": "ui"
    },
    {
      "name": "github-wikis",
      "description": "Comprehensive guide for working with GitHub repository wikis. Use when users need to work with GitHub wikis for documentation, including creating and editing wiki pages, managing permissions, working with wikis locally via Git, creating navigation elements (sidebars/footers), viewing history, or understanding wiki capabilities and limitations.",
      "path": "github-wikis.skill",
      "triggers": [
        "cli",
        "git",
        "github",
        "go",
        "ink"
      ],
      "category": "ui"
    },
    {
      "name": "local-skill-creator",
      "description": "Local skill creation toolkit for Claude Code. Use when users want to create, edit, or package skills locally on their PC using Claude Code. This skill provides all tools, templates, and guidance for building complete skills that can be distributed as .skill files. Works entirely in the current working directory.",
      "path": "local-skill-creator.skill",
      "triggers": [
        "api",
        "cli",
        "go",
        "ink",
        "material",
        "next",
        "python",
        "react",
        "validation"
      ],
      "category": "ui"
    },
    {
      "name": "pdf-to-markdown",
      "description": "Convert PDF documents to LLM-friendly Markdown format using pymupdf4llm. Use when working with PDF files that need to be converted to markdown, extracted as text for analysis, or made accessible for LLM processing. Handles complex layouts, tables, multi-column documents, and preserves formatting structure.",
      "path": "pdf-to-markdown.skill",
      "triggers": [
        "python"
      ],
      "category": "database"
    },
    {
      "name": "plugin-builder",
      "description": "Build Claude Code plugins from scratch or by composing existing skills. Use when creating new plugins, converting skills to plugins, adding commands/agents/hooks/MCP servers to plugins, packaging plugins for distribution, or publishing plugins to marketplaces. Triggers include requests to create a plugin, make a Claude Code extension, add commands or agents, set up hooks, configure MCP servers, test plugins locally, create a marketplace, publish plugins, or distribute plugins to teams.",
      "path": "plugin-builder.skill",
      "triggers": [
        "auth",
        "git",
        "github",
        "go",
        "mcp",
        "python",
        "rust",
        "security",
        "validation"
      ],
      "category": "ui"
    },
    {
      "name": "uiverse",
      "description": "Extract HTML and CSS code from UIVerse.io UI components. Use this when the user wants to get the code for a specific UIVerse component URL. It bypasses Cloudflare and returns clean HTML/CSS.",
      "path": "uiverse.skill",
      "triggers": [
        "auth",
        "python"
      ],
      "category": "ui"
    },
    {
      "name": "v0-version-planner",
      "description": "Systematic version planning before starting v0 (initial prototype) development. Use when the user wants to validate and update dependency versions in project blueprints, technical plans, or before starting development on a new project. Checks that all specified library/framework versions are current stable releases to prevent technical debt. Triggers on phrases like \"check versions\", \"update blueprint dependencies\", \"plan v0 development\", \"validate tech stack versions\", or when starting a new project with a technical blueprint.",
      "path": "v0-version-planner.skill",
      "triggers": [
        "biome",
        "eslint",
        "go",
        "java",
        "mcp",
        "next",
        "python",
        "react",
        "rust",
        "typescript",
        "validation",
        "zod"
      ],
      "category": "testing"
    },
    {
      "name": "web-scraper",
      "description": "Web scraping with Cloudflare bypass capability. Use when Claude needs to fetch content from websites that may have bot protection, especially sites protected by Cloudflare. Automatically converts HTML to clean markdown format for easy processing. Use for retrieving documentation, articles, or any web content that needs to be analyzed or processed.",
      "path": "web-scraper.skill",
      "triggers": [
        "api",
        "python",
        "security"
      ],
      "category": "api"
    }
  ],
  "agent_categories": {},
  "skill_categories": {
    "database": [
      "claude-code-hooks",
      "gemini-collaborate",
      "code-cleanup-final-pass",
      "biome",
      "pdf-to-markdown",
      "claude-code-hooks",
      "gemini-collaborate",
      "code-cleanup-final-pass",
      "biome",
      "pdf-to-markdown"
    ],
    "ui": [
      "gemini-cli",
      "gemini-genkit",
      "gsap",
      "motion",
      "astro-build",
      "express",
      "best-practices",
      "modern-frontend-design",
      "expo-android-widgets",
      "go-best-practices",
      "home-assistant-dev",
      "mcp-setup",
      "mcp-test-harness",
      "fastmcp-v3-migration",
      "node-to-bun-migration",
      "node-to-deno-migration",
      "nativewind",
      "shadcn",
      "rust-dev",
      "svelte5",
      "tauri",
      "playwright-cli",
      "get-time",
      "github-wikis",
      "local-skill-creator",
      "plugin-builder",
      "uiverse",
      "gemini-cli",
      "gemini-genkit",
      "gsap",
      "motion",
      "astro-build",
      "express",
      "best-practices",
      "modern-frontend-design",
      "expo-android-widgets",
      "go-best-practices",
      "home-assistant-dev",
      "mcp-setup",
      "mcp-test-harness",
      "fastmcp-v3-migration",
      "node-to-bun-migration",
      "node-to-deno-migration",
      "nativewind",
      "shadcn",
      "rust-dev",
      "svelte5",
      "tauri",
      "playwright-cli",
      "get-time",
      "github-wikis",
      "local-skill-creator",
      "plugin-builder",
      "uiverse"
    ],
    "general": [
      "mypy",
      "mypy"
    ],
    "testing": [
      "v0-version-planner",
      "v0-version-planner"
    ],
    "api": [
      "web-scraper",
      "web-scraper"
    ]
  }
}